app/controllers/applicant_login_controller.rb

    def create
        puts "email:#{params[:applicant][:email]}"
        @applicant_record = Applicant.find_by_email(params[:applicant][:email])
        if !@applicant_record.nil?
            @Applicant = @applicant_record["id"]
        else
            @Applicant=Applicant.new(applicant_params)
            @Applicant.save
---
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."email" = $1 LIMIT $2  [["email", "nee"], ["LIMIT", 1]]
INSERT INTO "applicants" ("email", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "nee"], ["name", "nee"], ["created_at", "2018-09-14 18:54:33.212149"], ["updated_at", "2018-09-14 18:54:33.212149"]]