app/controllers/company_controller.rb

SELECT "companies".* FROM "companies"
SELECT  1 AS one FROM "companies" LIMIT $1  [["LIMIT", 1]]
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT  1 AS one FROM "transactions" WHERE (company_id = 1 AND applicant_id = '15') LIMIT $1  [["LIMIT", 1]]
---
    def index
        @Applicant_id = params[:applicant]
        @company = Company.all
        if !@company.empty?
            @company.each do |com|
                com.disable_flag = false
                @transaction = Transaction.where("company_id = ? AND applicant_id = ?",com["id"],params[:applicant])
                if !@transaction.empty?

INSERT INTO "transactions" ("applicant_id", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["applicant_id", 16], ["company_id", 2], ["created_at", "2018-09-14 17:34:16.993546"], ["updated_at", "2018-09-14 17:34:16.993546"]]
---
    def trans_create
        @trans_create=Transaction.new(trans_permit)
        @trans_create.save