app/controllers/employer_login_controller.rb

    def list
        @employer_record = Employer.find_by_email(params[:employer][:email])
        @applicant_list_arr = Array[]
        if !@employer_record.nil?
            company_id = @employer_record["company_id"]
            @transaction = Transaction.where("company_id = ?",company_id)
            @company = Company.where("id =?",company_id)
            @company_name = @company[0]["name"]
            if !@transaction.nil?
                @transaction.each do |trans|
                    @applicant_record = Applicant.where("id =?",trans["applicant_id"])
                    if !@applicant_record.empty?
                        @applicant_record.each do |com|
---
SELECT  "employers".* FROM "employers" WHERE "employers"."email" = $1 LIMIT $2  [["email", "walmart@gmail.com"], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE (company_id = 1)
SELECT "companies".* FROM "companies" WHERE (id =1)
SELECT "applicants".* FROM "applicants" WHERE (id =1)
SELECT  1 AS one FROM "applicants" WHERE (id =1) LIMIT $1  [["LIMIT", 1]]